cmsis-svd/cmsis-svd/data/Fujitsu/MB9AFA4xL.xml
        <!-- REGISTER "LCDC_SEGEN2" -->
        <register>
          <name>LCDC_SEGEN2</name>
          <description>LCDC SEG Output Enable Register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x38</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEG37" -->
            <field>
              <name>SEG37</name>
              <description>Segment 37</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG36" -->
            <field>
              <name>SEG36</name>
              <description>Segment 36</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEG35" -->
            <field>
              <name>SEG35</name>
              <description>Segment 35</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LCDC_BLINK" -->
        <register>
          <name>LCDC_BLINK</name>
          <description>LCDC Blink Setting Register</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BLD15" -->
            <field>
              <name>BLD15</name>
              <description>Blink operation control bit 15</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD14" -->
            <field>
              <name>BLD14</name>
              <description>Blink operation control bit 14</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD13" -->
            <field>
              <name>BLD13</name>
              <description>Blink operation control bit 13</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD12" -->
            <field>
              <name>BLD12</name>
              <description>Blink operation control bit 12</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD11" -->
            <field>
              <name>BLD11</name>
              <description>Blink operation control bit 11</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD10" -->
            <field>
              <name>BLD10</name>
              <description>Blink operation control bit 10</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD09" -->
            <field>
              <name>BLD09</name>
              <description>Blink operation control bit 9</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD08" -->
            <field>
              <name>BLD08</name>
              <description>Blink operation control bit 8</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD07" -->
            <field>
              <name>BLD07</name>
              <description>Blink operation control bit 7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD06" -->
            <field>
              <name>BLD06</name>
              <description>Blink operation control bit 6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD05" -->
            <field>
              <name>BLD05</name>
              <description>Blink operation control bit 5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD04" -->
            <field>
              <name>BLD04</name>
              <description>Blink operation control bit 4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD03" -->
            <field>
              <name>BLD03</name>
              <description>Blink operation control bit 3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD02" -->
            <field>
              <name>BLD02</name>
              <description>Blink operation control bit 2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD01" -->
            <field>
              <name>BLD01</name>
              <description>Blink operation control bit 1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BLD00" -->
            <field>
              <name>BLD00</name>
              <description>Blink operation control bit 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
